OpenNuvoton/M480BSP/Library/StdDriver/src/fmc.c
    if (FMC->ISPSTS & FMC_ISPSTS_ISPFF_Msk)
    {
        FMC->ISPSTS |= FMC_ISPSTS_ISPFF_Msk;
        g_FMC_i32ErrCode = -1;
        return -1;
    }
    return 0;
}

/**
  * @brief Execute ISP FMC_ISPCMD_PROGRAM_64 to program a double-word to flash.
  * @param[in]  u32addr Address of the flash location to be programmed.
  *             It must be a double-word aligned address.
  * @param[in]  u32data0   The word data to be programmed to flash address u32addr.
  * @param[in]  u32data1   The word data to be programmed to flash address u32addr+4.
  * @return   0   Success
  * @return   -1  Failed
  *
  * @note     Global error code g_FMC_i32ErrCode
  *           -1  Program failed or time-out
  */
int32_t FMC_Write8Bytes(uint32_t u32addr, uint32_t u32data0, uint32_t u32data1)
{
    int32_t  tout;

    g_FMC_i32ErrCode = 0;
    FMC->ISPCMD  = FMC_ISPCMD_PROGRAM_64;
    FMC->ISPADDR = u32addr;
    FMC->MPDAT0  = u32data0;
    FMC->MPDAT1  = u32data1;
    FMC->ISPTRG  = FMC_ISPTRG_ISPGO_Msk;

    tout = FMC_TIMEOUT_WRITE;
    while ((tout-- > 0) && (FMC->MPSTS & FMC_MPSTS_MPBUSY_Msk)) {}
    if (tout <= 0)
    {
        g_FMC_i32ErrCode = -1;
        return -1;
    }

    if (FMC->ISPSTS & FMC_ISPSTS_ISPFF_Msk)
    {
        FMC->ISPSTS |= FMC_ISPSTS_ISPFF_Msk;
        g_FMC_i32ErrCode = -1;
        return -1;
    }
    return 0;
}


/**
  * @brief   Program Multi-Word data into specified address of flash.
  * @param[in]  u32Addr    Start flash address in APROM where the data chunk to be programmed into.
  *                        This address must be 16-bytes aligned to flash address.
  * @param[in]  pu32Buf    Buffer that carry the data chunk.
  * @param[in]  u32Len     Length of the data chunk in bytes.
  * @retval   >=0  Number of data bytes were programmed.
  * @return   -1   Program failed.
  * @return   -2   Invalid address.
  *
  * @note     Global error code g_FMC_i32ErrCode
  *           -1  Program failed or time-out
  *           -2  Invalid address
  */
int32_t FMC_WriteMultiple(uint32_t u32Addr, uint32_t pu32Buf[], uint32_t u32Len)
{
    uint32_t i, idx, u32OnProg;
    int32_t err, retval = 0, i32TimeOutCnt;
    uint32_t u32MPStatus = 0;
    g_FMC_i32ErrCode = 0;

    if((u32Addr >= FMC_APROM_END) || ((u32Addr % 16) != 0))
    {
        g_FMC_i32ErrCode = -2;
        return -2;
    }

    idx = 0u;
    FMC->ISPCMD = FMC_ISPCMD_PROGRAM_MUL;
    FMC->ISPADDR = u32Addr;

    do
    {
        err = 0;
        if(idx < (u32Len / 4u))
        {
            u32OnProg = 1u;
        }
        else
        {
            u32OnProg = 0u;
            break;
        }
        FMC->MPDAT0  = pu32Buf[idx++];
        FMC->MPDAT1  = pu32Buf[idx++];
        FMC->MPDAT2  = pu32Buf[idx++];
        FMC->MPDAT3  = pu32Buf[idx++];
        retval += 16;
        FMC->ISPTRG = FMC_ISPTRG_ISPGO_Msk;

        for(i = idx; i < (u32Len / 4u); i += 4u) /* Max data length is 512 bytes (512/4 words) */
        {
            i32TimeOutCnt = FMC_TIMEOUT_WRITE;

            do
            {
                if((FMC->MPSTS & FMC_MPSTS_MPBUSY_Msk) == 0u)
                {
                    FMC->ISPADDR = (FMC->MPADDR + 8) & (~0xful);
                    idx = (FMC->ISPADDR - u32Addr) / 4u;
                    retval = FMC->ISPADDR - u32Addr;
                    err = -1;
                }
                if( i32TimeOutCnt-- <= 0)
                {
                    g_FMC_i32ErrCode = -1;
                    err = -1;
                }
            }
            while((FMC->MPSTS & (3u << FMC_MPSTS_D0_Pos)) && (err == 0));

            if(err == 0)
            {
                retval += 8;

                /* Update new data for D0 */
                FMC->MPDAT0 = pu32Buf[i];
                FMC->MPDAT1 = pu32Buf[i + 1u];
                i32TimeOutCnt = FMC_TIMEOUT_WRITE;
                do
                {
                    if((FMC->MPSTS & FMC_MPSTS_MPBUSY_Msk) == 0u)
                    {
                        FMC->ISPADDR = (FMC->MPADDR + 8) & (~0xful);
                        idx = (FMC->ISPADDR - u32Addr) / 4u;
                        retval = FMC->ISPADDR - u32Addr;
                        err = -1;
                    }
                    if( i32TimeOutCnt-- <= 0)
                    {
                        g_FMC_i32ErrCode = -1;
                        err = -1;
                    }
                }
                while((FMC->MPSTS & (3u << FMC_MPSTS_D2_Pos)) && (err == 0));

                if(err == 0)
                {
                    retval += 8;

                    /* Update new data for D2 */
                    FMC->MPDAT2 = pu32Buf[i + 2u];
                    FMC->MPDAT3 = pu32Buf[i + 3u];
                }

                if(i + 4u >= (u32Len / 4u))
                {
                    i32TimeOutCnt = FMC_TIMEOUT_WRITE;
                    do
                    {
                        u32MPStatus = FMC->MPSTS;
                        if(((u32MPStatus & FMC_MPSTS_MPBUSY_Msk) == 0u) && (u32MPStatus & (0xF << FMC_MPSTS_D0_Pos)))
                        {
                            FMC->ISPADDR = (FMC->MPADDR + 8) & (~0xful);
                            idx = (FMC->ISPADDR - u32Addr) / 4u;
                            retval = FMC->ISPADDR - u32Addr;
                            err = -1;
                        }
                        if( i32TimeOutCnt-- <= 0)
                        {
                            g_FMC_i32ErrCode = -1;
                            err = -1;
                        }
                    }
                    while((u32MPStatus & (0xF << FMC_MPSTS_D0_Pos)) && (err == 0));
                }
            }

            if(err < 0)
            {
                break;
            }
        }
        if(err == 0)
        {
            u32OnProg = 0u;
            i32TimeOutCnt = FMC_TIMEOUT_WRITE;
            while(FMC->ISPSTS & FMC_ISPSTS_ISPBUSY_Msk)
            {
                if( i32TimeOutCnt-- <= 0)
                {
                    g_FMC_i32ErrCode = -1;
                    break;
                }
            }
        }
    }
    while(u32OnProg);

    return retval;
}


/**
  * @brief Program a 64-bits data to the specified OTP.
  * @param[in] otp_num    The OTP number.
  * @param[in] low_word   Low word of the 64-bits data.
  * @param[in] high_word   Low word of the 64-bits data.
  * @retval   0   Success
  * @retval   -1  Program failed.
  * @retval   -2  Invalid OTP number.
  *
  * @note     Global error code g_FMC_i32ErrCode
  *           -1  Program failed or time-out
  *           -2  Invalid OTP number
  */
int32_t FMC_Write_OTP(uint32_t otp_num, uint32_t low_word, uint32_t high_word)
{
    int32_t  tout;

    g_FMC_i32ErrCode = 0;

    if (otp_num > 255UL)
    {
        g_FMC_i32ErrCode = -2;
        return -2;
    }

